{
    "Biyoloji Dersine Hazırlık": [
        "Biyolojiye başlamadan önce hangi özelliklere sahip olmalısınız?",
        "Biyoloji öğrenirken hangi alanlarda ek bilgi sahibi olmanız faydalı olabilir?",
        "Bilimsel yöntemin temel kavramları nelerdir?",
        "Genel kimya bilgisi biyolojiye nasıl katkı sağlar?",
        "Asit-baz kimyası biyokimyada neden önemlidir?",
        "Termodinamik kanunları biyoloji açısından neden önemlidir?",
        "Olasılık kuralları biyolojiye hangi konularda yardımcı olur?",
        "İstatistik bilgisi biyoloji öğreniminde nasıl bir rol oynar?",
        "Temel cebir ve grafik bilgisi biyolojide nasıl kullanılır?"
    ],
    "Yaşam Nedir?": [
        "Biyoloji nedir?",
        "Yaşamın özelliklerinden biri olan organizasyon nedir?",
        "Metabolizma nedir ve hangi iki ana süreçten oluşur?",
        "Homeostaz nedir ve nasıl korunur?",
        "Canlı organizmalar nasıl büyür ve gelişir?",
        "Üreme nedir ve hangi iki yolla gerçekleşir?",
        "Canlı organizmaların çevrelerindeki uyaranlara verdikleri tepki nasıl tanımlanır?",
        "Evrim nedir ve adaptasyon süreci nasıl gerçekleşir?",
        "Cansız varlıklar hangi yaşam özelliklerinin bir kısmını sergileyebilir?"
    ],
    "Bilimsel Yöntem": [
        "1. Biyoloji araştırması genellikle hangi aşama ile başlar?",
        "2. Bilimsel yöntemin kaç temel adımı vardır?",
        "3. Bir hipotezin geçerli olması için hangi iki özelliğe sahip olması gerekmektedir?",
        "4. Teori ve hipotez arasındaki fark nedir?",
        "5. Günlük hayattan verilen örnekte ekmek kızartma makinesinin çalışmaması için önerilen ilk hipotez nedir?",
        "6. Bilimsel yöntemin son adımı nedir?",
        "7. Pratik anlamda bir hipotezi çürütmek neden zordur?",
        "8. Hipotezlerin kesin olarak kanıtlanamamasının mantıksal sebebi nedir?",
        "9. Neden bir hipotezi test etmek için deney yapmak önemlidir?"
    ],
    "Kontrollü Deneyler": [
        "Bilimsel yöntem nedir ve nasıl başlar?",
        "Hipotez nedir ve bilim insanları hipotezleri nasıl kullanır?",
        "Kontrollü deney nedir ve nasıl yürütülür?",
        "Kontrollü deneylerde kontrol grubu nedir ve neden önemlidir?",
        "Bağımsız ve bağımlı değişkenler nedir ve nasıl farklıdır?",
        "Deneylerde neden büyük numuneler ve tekrarlar önemlidir?",
        "Mercan kayalıklarının beyazlamasıyla ilgili yapılan kontrollü deneyde bağımsız değişken nedir?",
        "Mercan kayalıkları beyazlama deneyinde neden kontrol grubu kullanılmıştır?",
        "Bilim insanları hipotezleri etik veya pratik sebeplerle deneyle test edemediklerinde ne yaparlar?"
    ],
    "Konu özeti: Su ve Yaşam": [
        "Polar molekülün tanımı nedir?",
        "Kohezyon nedir?",
        "Adezyon nedir?",
        "Bir maddenin yoğunluğu nasıl tanımlanır?",
        "Özgül ısı sığası ne anlama gelir?",
        "Buharlaşma ısısı nedir?",
        "Suyun polar olmasının sebebi nedir?",
        "Suyun mükemmel bir çözücü olmasının biyolojik önemi nedir?",
        "Suyun yüksek ısı sığasının çevre üzerindeki etkisi nedir?"
    ],
    "Madde, elementler ve atomlar": [
        "Vücudumuz en temel seviyede nelerden oluşur?",
        "Atomlar ve moleküller hangi yasalara uyar?",
        "Bir atomun merkezinde hangi parçacıklar bulunur?",
        "Canlı organizmaların yaklaşık %96'sını oluşturan dört temel element nelerdir?",
        "Proton, nötron ve elektronların yükleri ve kütleleri nasıldır?",
        "Bir elementin kimyasal sembolü nasıl belirlenir?",
        "Neden bazı elementler yalnızca laboratuvar ortamında üretilebilir?",
        "Atomların kimyasal tepkimelere girme kapasitesini belirleyen nedir?",
        "Hidrojen atomunun diğer atomlardan farkı nedir?"
    ],
    "Atom Numarası, Atom Kütlesi ve İzotoplar": [
        "Radyoaktivite nedir?",
        "Radyoaktif atomların kararsız çekirdeklerinin kararlı hale gelmek için yaptıkları süreç nedir?",
        "Bir elementin farklı versiyonlarına ne denir?",
        "Kütle numarası nasıl hesaplanır?",
        "Atom kütlesi nedir ve nasıl ifade edilir?",
        "Karbon-14 izotopu doğada nasıl bulunur ve fosillerin yaşını saptamada nasıl kullanılır?",
        "Bir elementin atom ağırlığı nedir ve nasıl belirlenir?",
        "Radyoaktif bozunma nedir ve nasıl gerçekleşir?",
        "Yarı ömür nedir ve nasıl kullanılır?"
    ],
    "Periyodik Tablo, Elektron Kabukları ve Orbitaller": [
        "Periyodik tabloyu kim oluşturdu?",
        "Periyodik tablo elementleri hangi iki kritere göre sıralar?",
        "Hangi elementler periyodik tabloda 1. grup elementleri olarak yer alır?",
        "Hangi elementler soygaz veya asal gaz olarak adlandırılır?",
        "Bohr Atom Modeli'ne göre elektronlar hangi kabuklarda yer alır?",
        "Oktet kuralı nedir ve hangi elementler bu kurala uyar?",
        "Bir atomun değerlik kabuğu nedir?",
        "Elektron kabukları ve orbitaller arasındaki fark nedir?",
        "Elektronların bulunduğu bölgeye ne ad verilir?"
    ],
    "Kimyasal Bağlar": [
        "Atomlar neden kimyasal bağlar oluştururlar?",
        "İyonlar nasıl oluşur?",
        "Katyon nedir ve nasıl oluşur?",
        "Anyon nedir ve nasıl oluşur?",
        "İyonik bağlar nasıl oluşur?",
        "Kovalent bağ nedir ve nasıl oluşur?",
        "Polar kovalent bağlar nasıl oluşur?",
        "Apolar kovalent bağlar nasıl oluşur?",
        "Hidrojen bağları nedir ve nasıl oluşur?"
    ],
    "Kimyasal Tepkimeler": [
        "1. Kimyasal tepkimeye giren maddelere ne ad verilir?",
        "2. Kimyasal tepkimelerde ürün nedir?",
        "3. Hidrojen peroksitin su ve oksijene ayrıştığı tepkime nasıl gösterilir?",
        "4. Kimyasal bağların kopması ile ne oluşur?",
        "5. Kimyasal tepkimelerde dengeyi sağlamak için ne yapılmalıdır?",
        "6. Tersinmez tepkimeler nasıl tanımlanır?",
        "7. Tersinir tepkimelerde ürünler neye dönüşebilir?",
        "8. Kimyasal tepkimeler sırasında hangi sayılar tepkimede kaç molekülün yer aldığını belirtir?",
        "9. Bikarbonatın hidrojen iyonu ile birleşmesi sonucu ne oluşur?"
    ],
    "Sudaki Hidrojen Bağları": [
        "1. İnsan vücudunun yüzde kaçı sudan oluşur?",
        "2. Sitoplazmada bulunan su bazlı \"yapışkan hücre sıvısı\"na ne ad verilir?",
        "3. Suyun, hücrelerden ekosistemlere kadar biyolojide önemli olmasını sağlayan özellikleri nelerdir?",
        "4. Su, polar ve yüklü molekülleri nasıl çözer?",
        "5. Suyun kohezyonu ve adezyonu ne anlama gelir?",
        "6. Suyun ısı sığası ve buharlaşma ısısı neden yüksektir?",
        "7. Buzun yoğunluğu neden suyun yoğunluğundan daha azdır?",
        "8. Su molekülü hangi atomlardan oluşur ve bu atomların dizilimi nasıldır?",
        "9. Su molekülünde O−H bağları arasındaki açı kaç derecedir?"
    ],
    "Suyun Çözücü Özellikleri": [
        "Limonata yaparken şekerin çözünmesi suyun hangi özelliğini gösterir?",
        "Su moleküllerinin polaritesi ne anlama gelir?",
        "Sulu çözelti nedir ve yaşam için neden önemlidir?",
        "Su molekülleri arasında hangi tür bağlar bulunur?",
        "Suyun polarlığı apolar moleküllere karşı nasıl davranır?",
        "Hidrasyon kabuğu nedir ve nasıl oluşur?",
        "NaCl suya atıldığında ne tür bir süreç yaşanır?",
        "Apolar moleküllerin suyla etkileşimi neden zayıftır?",
        "Sofra tuzunun su içinde nasıl dağıldığını açıklayınız."
    ],
    "Suyun Kohezyon (Birleşme) ve Adezyon (Yapışma) Özellikleri": [
        "Suyun kohezyon özelliği nedir?",
        "Bardağın ağzına kadar dolup taşmadan kubbe benzeri bir şekil oluşturan suyun özelliği nedir?",
        "Hidrojen bağlarının su molekülleri arasındaki kohezyonu nasıl etkilediğini açıklayın.",
        "Yüzey gerilimi nedir ve nasıl oluşur?",
        "Suyun yüzey gerilimine örnek olarak ne verilebilir?",
        "Suyun adezyon özelliği nedir?",
        "Suyun adezyon özelliği hangi koşullar altında daha belirgin hale gelir?",
        "Kılcal hareket nedir ve nasıl gerçekleşir?",
        "Menisküs nedir ve nasıl oluşur?"
    ],
    "Suyun Özgül Isısı, Buharlaşma Isısı ve Yoğunluğu": [
        "1. Hidrojen bağları suyun hangi fiziksel özelliklerini açıklar?",
        "2. Su molekülleri hangi bağlar sayesinde birbirleriyle etkileşim kurar?",
        "3. Suyun buharlaşmasının vücut sıcaklığını nasıl etkilediğini açıklayınız.",
        "4. Buzun yoğunluğunun sudan düşük olmasının nedeni nedir?",
        "5. Su neden bazı diğer sıvılar gibi donarken yoğunlaşmaz?",
        "6. Suyun özgül ısısının yüksek olmasının çevresel etkileri nelerdir?",
        "7. Suyun buharlaşma ısısının yüksek olması ne anlama gelir?",
        "8. Su moleküllerinin sıvı halden gaz hale geçmesi hangi bağların kopmasıyla gerçekleşir?",
        "9. Buzun suda yüzmesinin biyolojik önemi nedir?"
    ],
    "Asitler, Bazlar, pH ve Tampon Sistemleri": [
        "Portakal suyu gibi asidik çözeltilerin yaygın örneklerinden biri nedir?",
        "Bazların mutfakta kullanılan iki yaygın örneği nedir?",
        "Hidrojen iyonu (H+) yoğunluğu asidik bir çözeltide nasıldır?",
        "Suyun otoiyonizasyonu süreci nedir?",
        "Saf suda hidrojen iyonu yoğunluğu nedir?",
        "Bir mol nedir ve kaç tane parçacık içerir?",
        "Bir maddenin bir molünün gram cinsinden kütlesi neye eşittir?",
        "pH değeri nasıl hesaplanır?",
        "Kuvvetli bir asit olan hidroklorik asit (HCl) suda nasıl ayrışır?"
    ],
    "Karbon ve Hidrokarbonlar": [
        "Karbonun günlük hayatta hangi formlarda karşılaşıldığını örneklerle açıklayınız.",
        "Vücudumuzdaki karbon oranı yaklaşık olarak nedir?",
        "Hangi biyolojik moleküller karbon atomlarını temel yapı taşı olarak kullanır?",
        "Organik molekül terimi ne anlama gelir?",
        "Karbon atomu neden büyük moleküllerin temelini oluşturmak için uygundur?",
        "Karbonun kovalent bağ yapma kapasitesi nasıldır ve diğer elementlerle karşılaştırıldığında neden avantajlıdır?",
        "Bir karbon atomu kaç atomla kovalent bağ yapabilir?",
        "Metandaki karbon atomu kaç hidrojen atomuyla bağ yapar ve nasıl bir yapıya sahiptir?",
        "Hidrokarbon nedir ve günlük hayatta hangi örneklerle karşılaşılır?"
    ],
    "Hidrokarbonların Yapıları ve İzomerler": [
        "1. Benzin moleküler düzeyde hangi tür moleküllerden oluşur?",
        "2. Benzindeki hidrokarbonların erime ve kaynama noktaları nasıl farklılık gösterir?",
        "3. Hidrokarbonlar hangi bağ tiplerini içerebilirler?",
        "4. Eten (C2H4) molekülü hangi yapısal özelliğe sahiptir ve karbon-karbon çift bağı etrafında dönemez?",
        "5. Etin (C2H2) molekülü hangi yapısal özelliklere sahiptir ve üçlü bağı etrafında dönemez?",
        "6. Hidrokarbonlarda karbon atomları hangi şekilleri oluşturabilir?",
        "7. Yapısal izomerlerde atomlar nasıl farklı şekillerde bağlanır?",
        "8. Stereoizomerler hangi iki ana sınıfa ayrılır?",
        "9. Enantiyomerler hangi geometrik ilişkiye sahiptirler?"
    ],
    "Fonksiyonel Gruplar": [
        "Hidrokarbonlar sadece hangi atomlardan oluşur?",
        "Biyolojik moleküllerin çoğu, karbon ve hidrojen dışında hangi atomları da içerir?",
        "Fonksiyonel gruplar nedir?",
        "Bir biyomolekülün sahip olduğu fonksiyonel gruplar hangi özelliklerini etkileyebilir?",
        "Hidrofobik olan tek fonksiyonel grup hangisidir?",
        "Karboksil grubu sulu çözeltilerde nasıl bir iyon oluşturur?",
        "Karbonil grubu neden polar olarak değerlendirilir?",
        "Amino grupları çözeltilerden hangi iyonları uzaklaştırarak bazik özellik gösterir?",
        "Fosfat grupları hangi pH değerinde yüklüdür?"
    ],
    "Makromoleküller": [
        "Büyük biyolojik moleküller nelerdir?",
        "Monomer ve polimer arasındaki fark nedir?",
        "Dehidrasyon sentezi nedir ve nasıl gerçekleşir?",
        "Karbonhidratların vücuttaki temel işlevleri nelerdir?",
        "Lipitler neden bazı kaynaklarda makromolekül olarak sınıflandırılmaz?",
        "Nükleik asitlerin biyolojik işlevleri nelerdir?",
        "Hidroliz tepkimesi nedir ve nasıl gerçekleşir?",
        "Hangi enzimler dehidrasyon sentezi ve hidroliz tepkimelerini katalizler?",
        "Proteinlerin vücuttaki işlevleri nelerdir?"
    ],
    "Karbonhidratlar": [
        "Patatesin ortalama ağırlığının büyük bir kısmını hangi madde oluşturur?",
        "Ortalama bir patateste kaç gram karbonhidrat bulunur?",
        "Nişasta hangi moleküllerden oluşur ve enerjinin depo edilme şekli nedir?",
        "Karbonhidratlar hangi elementlerden meydana gelir?",
        "Monosakkaritlerin genel formülü nedir ve kaç karbon atomu içerebilirler?",
        "Monosakkaritler ve polisakkaritler arasındaki temel fark nedir?",
        "Aldoz ve ketoz şekerler arasındaki fark nedir?",
        "Glikozun kimyasal formülü nedir?",
        "Glikoz, galaktoz ve fruktoz arasındaki temel fark nedir?"
    ],
    "Lipitler": [
        "1) Yağlar hangi molekül kategorisine aittir?",
        "2) Yağ asitleri hangi gruba bağlanan uzun hidrokarbon zincirlerinden oluşur?",
        "3) Lipitlerin suyla karışmama özellikleri ne ile ilgilidir?",
        "4) Trigliseritler hangi iki kısımdan oluşur?",
        "5) Doymuş yağ asitlerinin hidrokarbon zincirinde hangi tür bağlar bulunur?",
        "6) Cis formunda olan çift bağların özelliği nedir?",
        "7) Trans yağlar hangi yöntemle kolaylıkla üretilebilir?",
        "8) Omega-3 yağ asidinin ilk çift bağı hangi karbonlar arasında bulunur?",
        "9) Fosfolipitlerin hücre zarındaki düzenlemesinin enerji avantajı nedir?"
    ],
    "Biyolojik Makromoleküller Tekrar": [
        "Biyolojik makromolekül nedir?",
        "Monomer nedir ve biyolojik makromoleküllerle olan ilişkisi nedir?",
        "Polimer nedir ve nasıl oluşur?",
        "Karbonhidratların temel yapı taşları nelerdir?",
        "Lipitlerin hücrelerdeki temel fonksiyonları nelerdir?",
        "Proteinlerin yapı taşları ve temel işlevleri nelerdir?",
        "Nükleik asitlerin yapı taşları nelerdir ve bu moleküllerin temel fonksiyonları nelerdir?",
        "Makromoleküllerin büyüklüğü neden görecelidir?",
        "Hangi yanlış bilgi yağlar ve karbonhidratlar hakkında yaygındır?"
    ],
    "Metabolizma": [
        "Vücudunuzda bulunan hücrelerin metabolizması nedir?",
        "Hücresel solunum sırasında glikoz molekülü neye dönüşür?",
        "ATP neden hücrenin enerji para birimi olarak adlandırılır?",
        "Fotosentezin genel tepkimesi nedir?",
        "Anabolik patikalar nasıl çalışır ve ne tür moleküller üretir?",
        "Katabolik patikalar nasıl çalışır ve ne tür moleküller üretir?",
        "Metabolik patikalarda kimyasal tepkimelerin gerçekleşmesi için hangi proteinler gereklidir?",
        "Enerji gerektiren kimyasal tepkimeler için hücrelerin ne tür bir kaynağa ihtiyacı vardır?",
        "Glikozun parçalanması sürecinde açığa çıkan enerjiyi hücreler nasıl kullanır?"
    ],
    "Enerji Türleri": [
        "Enerji nedir ve biyolojik amaçlar için nasıl tanımlanır?",
        "Kinetik enerji nedir ve nasıl oluşur?",
        "Potansiyel enerji nedir ve bir cismin hangi özelliklerine bağlıdır?",
        "Isı enerjisi nedir ve nasıl oluşur?",
        "Kimyasal enerji nedir ve potansiyel enerjinin bir türü olarak neden kabul edilir?",
        "Bir yıkı güllesinin kinetik enerji ve potansiyel enerji durumu nasıl değişir?",
        "Enerji dönüşümlerine bir örnek olarak benzinin kimyasal enerjisinin nasıl kullanıldığını açıklayın.",
        "ATP molekülünün bağlarında depolanan enerjinin canlı organizmalarda nasıl kullanıldığını açıklayın.",
        "Kinetik enerjinin diğer örneklerinden bazıları nelerdir?"
    ],
    "Termodinamik Yasaları": [
        "1. Bütün canlıların sistemleri açık mı yoksa kapalı bir sistem midir?",
        "Bir sistemin çevresi ile madde ve enerji alışverişi yapabilmesi hangi tür sistem olarak adlandırılır?",
        "Termodinamik yasaları canlı organizmalarda gerçekleşen enerji alışverişlerini nasıl açıklar?",
        "Termodinamik dersi kapsamında bir hücre ve bir ekosistem arasındaki enerji aktarımlarını araştırmak neyi ifade eder?",
        "Bir sistemi ve çevresini tanımlarken gözlemcinin rolü nedir?",
        "Açık, kapalı ve izole sistemler arasındaki temel farklar nelerdir?",
        "Kapalı sistemler çevreleri ile ne tür alışverişlerde bulunurlar?",
        "Kusursuz bir izole sistem oluşturmak neden zordur?",
        "Enerji dönüşümleri sırasında bazı enerjilerin termal enerji olarak çevreye salınmasının sonuçları nelerdir?"
    ],
    "Serbest Enerji": [
        "1. \"Serbest enerji\" terimi biyolojide neyi ifade eder?",
        "Termodinamiğin İkinci Yasası'na göre bir süreç nasıl kendiliğinden gerçekleşir?",
        "Gibbs serbest enerjisi nedir ve neyi ölçer?",
        "ΔG değerinin negatif veya pozitif olması ne anlama gelir?",
        "ΔH ve ΔS nedir ve tepkimenin kendiliğindenliğini nasıl etkiler?",
        "Sıcaklık (T) ΔG denkleminde nasıl bir rol oynar?",
        "Egzergonik ve endergonik tepkimeler arasındaki fark nedir?",
        "Kimyasal dengenin biyolojik tepkimeler üzerindeki etkisi nedir?",
        "Hücreler kimyasal tepkimelerini denge durumunun dışında nasıl tutar?"
    ],
    "ATP ve Tepkime Eşleşmesi": [
        "ATP’nin hücre içindeki rolü nedir?",
        "ATP'nin hidrolizi sırasında hangi bağlar parçalanır?",
        "ATP yapısındaki fosfat gruplarına verilen isimler nelerdir?",
        "ATP, ADP ve Pi'ye hidroliz edildiğinde ortaya çıkan enerji miktarı standart koşullarda ne kadardır?",
        "ATP'nin yeniden oluşturulması için hangi bileşikler ve enerji gereklidir?",
        "ATP'nin ADP'ye hidrolizi tersine çevrilebilir mi?",
        "ATP'nin ADP'ye hidrolizi sırasında hangi ürünler ortaya çıkar?",
        "ATP'nin hücresel tepkimelerde nasıl kullanıldığına bir örnek verebilir misiniz?",
        "Sodyum-potasyum pompasının çalışmasında ATP'nin rolü nedir?"
    ],
    "Aktivasyon Enerjisi": [
        "Aktivasyon enerjisi nedir?",
        "Aktivasyon enerjisi kısaca nasıl ifade edilir?",
        "Negatif ∆G değerli enerjiyi açığa çıkaran bir tepkime neden enerjiye ihtiyaç duyar?",
        "Geçiş evresi nedir ve neden önemlidir?",
        "Aktivasyon enerjisi ile tepkime hızı arasındaki ilişki nedir?",
        "Aktivasyon enerjisi nasıl genellikle sağlanır?",
        "Bir tepkimenin egzergonik ya da endergonik olmasına bağlı olarak aktivasyon enerjisi değişir mi?",
        "Katalizörlerin aktivasyon enerjisi üzerindeki etkisi nedir?",
        "Hücre içindeki kimyasal tepkimelerin çoğu neden ortam sıcaklığında gerçekleşmez?"
    ],
    "Enzimler ve Aktif Bölge": [
        "1. Enzimler kimyasal tepkimelerin aktivasyon enerjisini nasıl etkiler?",
        "2. Enzimler genellikle hangi tür biyomoleküllerdir?",
        "3. Enzimlerin aktif bölgesi nedir ve ne işe yarar?",
        "4. pH değeri enzimlerin işlevselliğini nasıl etkiler?",
        "5. Sıcaklık, enzimlerin katalizleme yeteneğini nasıl etkiler?",
        "6. Enzim ve substrat arasındaki birleşmede hangi modelden bahsedilir?",
        "7. Enzimin substrat ile birleştiğinde şeklini değiştirmesi ne olarak adlandırılır?",
        "8. Enzimlerin spesifik substratlara özgül olmasını sağlayan nedir?",
        "9. Enzimler katalizleme görevini tamamladıktan sonra ne olur?"
    ],
    "Enzim Regülasyonu": [
        "Vücutta enzimlerin aynı anda ve aynı hücrede üretilmesi neden istenmeyen sonuçlar doğurabilir?",
        "Mide hücreleri neden diğer hücre türlerinden farklı enzimlere ihtiyaç duyar?",
        "Bir sindirim hücresi neden bir öğünü takip eden saatlerde daha güçlü çalışır?",
        "Enzim faaliyetlerini etkileyen ve kontrol eden faktörler nelerdir?",
        "Düzenleyici moleküllerin enzim etkinliği üzerindeki rolü nedir?",
        "Kofaktörlerin enzim aktivitesi üzerindeki etkisi nedir?",
        "Kompartmantalizasyonun enzim etkinliği üzerindeki faydaları nelerdir?",
        "Geri beslemeli inhibisyon nasıl çalışır?",
        "Yarışmalı ve yarışmasız inhibitörler arasındaki farklar nelerdir?"
    ],
    "Enzim Kinetiği Grafiklerinin Temelleri": [
        "Enzim kinetiği nedir ve neden önemlidir?",
        "Vmax değeri nedir ve nasıl belirlenir?",
        "Km değeri nedir ve enzimin substrata olan ilgisi hakkında ne bilgi verir?",
        "Yarışmalı inhibitörlerin enzimin kinetiği üzerindeki etkisi nedir?",
        "Yarışmasız inhibitörlerin enzimin kinetiği üzerindeki etkisi nedir?",
        "Substrat konsantrasyonunun tepkime hızı üzerindeki etkisi nasıl grafikleştirilir?",
        "Michaelis-Menten denklemi nedir ve neyi açıklar?",
        "Enzim doygunluğu ne anlama gelir ve grafikte nasıl gösterilir?",
        "Kooperatif enzimler nasıl davranır ve grafiklerde nasıl bir şekil oluşturur?"
    ],
    "Hücreler": [
        "Hücrelerin vücuttaki temel yapı taşları olduğunu nasıl açıklarsınız?",
        "Hücrelerin şekil ve hareket yetenekleri açısından tuğlalardan farkı nedir?",
        "Hücrelerin içinde bulunan yapılar ne işe yarar?",
        "Epitel hücrelerin vücuttaki görevleri nelerdir?",
        "Kemik hücreleri vücutta hangi işlevi yerine getirir?",
        "Bağışıklık sistemi hücreleri ne yapar?",
        "Hangi hücreler vücuda besin ve oksijen taşır?",
        "Hücre teorisi nedir ve kimler tarafından öne sürülmüştür?",
        "Robert Hooke hücreyi nasıl keşfetmiştir?"
    ],
    "Mikroskopi": [
        "Biyologlar neden mikroskoplara ilgi duyarlar?",
        "Hücrelerin güzelliği neye benzetilmektedir?",
        "Hangi bitkinin yaprağındaki hücreler mikroskopla incelenmiştir?",
        "Işık mikroskobu yerine hangi mikroskop tekniği kullanılmıştır?",
        "Işık mikroskoplarının temel çalışma prensibi nedir?",
        "Bileşik mikroskopların basit mikroskoplardan farkı nedir?",
        "Bir mikroskobun büyütme gücü neyi ifade eder?",
        "Çözünürlük kalitesi bir mikroskop için neden önemlidir?",
        "Elektron mikroskoplarının ışık mikroskoplarından temel farkı nedir?"
    ],
    "Prokaryot Hücreler": [
        "1. Prokaryot ve ökaryot hücreler arasındaki temel fark nedir?",
        "Prokaryot hücrelerin temel bileşenleri nelerdir?",
        "Prokaryot hücrelerde DNA nerde bulunur?",
        "Prokaryot hücreler nasıl hareket eder?",
        "Prokaryot hücrelerin yüzeyinde hangi yapılar bulunur?",
        "Peptidoglikan nedir ve ne işe yarar?",
        "Fimbria ve pilus arasındaki fark nedir?",
        "Prokaryot hücrelerde ribozomların görevi nedir?",
        "Prokaryot hücrelerin boyutu genellikle ne kadardır?"
    ],
    "Hücre Zarı ve Sitoplazma": [
        "Hücre nedir?",
        "Hücre zarı hangi yapılardan oluşur?",
        "Fosfolipit nedir ve nasıl bir yapıya sahiptir?",
        "Hücre zarında hangi tür proteinler bulunur ve işlevleri nelerdir?",
        "Hücre zarının akışkanlığını etkileyen faktörler nelerdir?",
        "Hücre zarının yüzey alanı neden önemlidir?",
        "Mikrovillus nedir ve hangi hücrelerde bulunur?",
        "Çölyak hastalığı mikrovillusları nasıl etkiler?",
        "Sitoplazmanın ana bileşenleri nelerdir?"
    ],
    "Hücre Çekirdeği ve Ribozomlar": [
        "Hücre çekirdeği ne tür bir bilgi içerir?",
        "Ökaryotik hücrelerde genetik materyal nerede saklanır?",
        "DNA çekirdeği nasıl terk edebilir?",
        "Ribozomlar protein sentezini nasıl yönlendirir?",
        "Çoğu hücrede kaç tane çekirdek bulunur?",
        "İskelet kası hücreleri neden çok çekirdeklidir?",
        "Çekirdek zarının yapısı nasıldır?",
        "Nükleer gözenek kompleksinin görevi nedir?",
        "Ribozomlar nasıl meydana gelir?"
    ],
    "İç Zar (Endomembran) Sistemi": [
        "İç zar sistemi nedir?",
        "Endoplazmik retikulumun (ER) temel görevleri nelerdir?",
        "Granüllü endoplazmik retikulum (granüllü ER) hangi yapılarla kaplıdır?",
        "Granüllü ER'nin protein modifikasyonunda nasıl bir rolü vardır?",
        "Granülsüz endoplazmik retikulumun (granülsüz ER) ana görevleri nelerdir?",
        "Granüllü ve granülsüz ER'nin yapısal farkları nelerdir?",
        "Golgi cisimciğinin (Golgi aygıtı) temel işlevleri nelerdir?",
        "Golgi cisimciğinde protein ve lipit modifikasyonları nasıl gerçekleşir?",
        "Lizozomların işlevi nedir ve kendilerini sindirmekten nasıl korunurlar?"
    ],
    "Mitokondriler ve Kloroplastlar": [
        "Mitokondrilerin temel görevi nedir?",
        "Kloroplastlar hangi organizmalarda bulunur?",
        "Endosimbiyotik teori nedir?",
        "Fotosentez sırasında hangi enerji türü kullanılır?",
        "Mitokondrilerde ATP üretimi hangi işlemle gerçekleşir?",
        "Kloroplastların iç yapısında hangi yapılar bulunur?",
        "Mitokondrilerin iç zarına ne ad verilir?",
        "Kloroplastlarda fotosentezde görev alan pigment nedir?",
        "ATP üretiminde proton gradyanı nasıl bir rol oynar?"
    ],
    "Hücre Dışı Matriks ve Hücre Duvarı": [
        "Hücre dışı matriksin hayvan hücrelerinde nasıl bir rolü vardır?",
        "Kolajen proteinlerinin hücre dışı matriks içinde nasıl bir işlevi vardır?",
        "Ehlers-Danlos sendromu hangi biyolojik yapıyı etkiler ve ne tür sorunlara yol açar?",
        "Proteoglikanlar hangi bileşenleri içerir ve bunların biyokimyasal özellikleri nelerdir?",
        "İntegrinler hücre dışı matrikste ne tür bir rol oynar?",
        "Kanın pıhtılaşması sürecinde hücre dışı matriksin rolü nedir?",
        "Bitki hücre duvarının temel bileşeni nedir ve bu bileşen nasıl bir yapıya sahiptir?",
        "Hücre duvarı hangi organizmalarda bulunur?",
        "Bitki hücre duvarındaki orta lamelin işlevi nedir?"
    ],
    "Hücreler Arası Bağlantılar": [
        "Hücreler arası bağlantılar, bitişik hücreler arasında hangi maddelerin geçişini sağlar?",
        "Plazmodezmler, bitki hücrelerinde hangi yapılar arasında doğrudan sitoplazmik değişim ve geçiş sağlar?",
        "Plazmodezmler ve ara bağlantılar arasında yapısal olarak hangi farklılıklar vardır?",
        "Ara bağlantılar, hangi hayvan hücre zarı proteinlerinin birleşmesiyle meydana gelir?",
        "Innexin proteini, hangi tür hayvanlarda ara bağlantıların oluşumunda rol oynar?",
        "Sıkı bağlantılar, hücreler arasında hangi tür bağlar oluşturur?",
        "Sıkı bağlantıların amacı nedir?",
        "İdrar kesesini kaplayan hücreler hangi tür hücreler arası bağlantı sayesinde sıvı geçirmez bir bariyer oluşturur?",
        "Dezmozomlar, hangi tür hücreler arasında kaynaşma noktası görevi görür?"
    ],
    "Prokaryot ve Ökaryotlar Tekrar": [
        "Endosimbiyoz teorisi nedir?",
        "Prokaryot ve ökaryot hücrelerin genetik bilgi depolama şekilleri nasıldır?",
        "Hangi hücre tipi (prokaryotlar mı ökaryotlar mı) zara bağlı organellere sahiptir?",
        "Prokaryot hücrelerin boyutları genellikle ne kadardır?",
        "Ökaryot hücreler hem tek hücreli hem çok hücreli olabilirler mi?",
        "Prokaryot hücrelerin örnekleri nelerdir?",
        "Endosimbiyoz teorisi hangi organellerin kökenini açıklar?",
        "Prokaryot ve ökaryot hücrelerin çekirdek yapıları nasıldır?",
        "Hangi hücre tipi her zaman tek hücrelidir?"
    ],
    "Hücre Zarının Yapısı": [
        "Hücre zarı hangi kıvama benzetilmiştir?",
        "Hücre zarının temel görevi nedir?",
        "Hücre zarı hangi maddelerden oluşur?",
        "Akışkan mozaik modeli ilk kez ne zaman önerilmiştir?",
        "Fosfolipitlerin hidrofilik kısmı nedir?",
        "Hücre zarının yapısında kolesterolün rolü nedir?",
        "Zar proteinleri kaça ayrılır ve isimleri nelerdir?",
        "Karbonhidrat grupları hücre zarında ne oluşturur?",
        "Hücre zarının akışkanlığını koruyan ek bileşen nedir?"
    ],
    "Difüzyon ve Pasif Taşıma": [
        "Hücre zarının seçici geçirgenlik özelliği ne anlama gelir?",
        "Pasif taşıma nedir ve hücrede nasıl gerçekleşir?",
        "Konsantrasyon gradyanı nedir ve difüzyon sürecinde nasıl bir rol oynar?",
        "Polar moleküller hücre zarından geçerken neden zorlanır?",
        "Küçük iyonlar zarın lipit kısmından geçerken neden zorlanır?",
        "Kolaylaştırılmış difüzyon nedir ve hangi moleküllerin geçişinde rol oynar?",
        "Kanal proteinleri ve taşıyıcı proteinler arasındaki farklar nelerdir?",
        "Akuaporinler ne işe yarar ve hangi hücrelerde bulunur?",
        "Elektrik sinyallerine tepki olarak açılıp kapanan kanal proteinleri hangi hücrelerde önemlidir?"
    ],
    "Aktif taşıma": [
        "Pasif taşıma hücre içerisine molekülleri nasıl taşır?",
        "Glikozun hücre içerisine alınması için hangi taşıma yöntemi gereklidir?",
        "Aktif taşıma sırasında enerji hangi formda harcanır?",
        "Elektrokimyasal gradyan nedir ve hangi faktörlerden etkilenir?",
        "Tipik bir hücre zarının potansiyel farkı nedir?",
        "Sodyum-potasyum pompası nasıl çalışır ve neyi taşır?",
        "Aktif taşıma için hücre enerjisini hangi süreçte harcar?",
        "İkincil aktif taşıma nasıl bir enerji kaynağı kullanır?",
        "Sodyum ve potasyum iyonlarının hareketini belirleyen faktörler nelerdir?"
    ],
    "Akışkan Mozaik Modeli: Hücre Zarı Makalesi": [
        "Hücre zarının başlıca bileşenleri nelerdir?",
        "Fosfolipitlerin iki ana kısmı nedir?",
        "Hücre zarı hangi özellikleri ile hücreyi dış ortamdan korur?",
        "Kolesterol hücre zarında ne rol oynar?",
        "İntegral ve periferal proteinler arasındaki fark nedir?",
        "Hücre zarının akışkanlığını etkileyen faktörler nelerdir?",
        "Doymuş ve doymamış yağ asitlerinin hücre zarına etkisi nedir?",
        "Hücre zarının yarı-geçirgen olmasının anlamı nedir?",
        "Alzheimer hastalığının hücre zarı ile ilişkisi nasıldır?"
    ],
    "Hücre Zarı Tekrar": [
        "Hücre zarı nedir ve hangi işlevleri yerine getirir?",
        "Hidrofobik terimi ne anlama gelir?",
        "Hidrofilik terimi ne anlama gelir?",
        "Amfipatik moleküller nasıl bir yapıya sahiptir?",
        "Fosfolipitler hangi bileşenlerden oluşur?",
        "Çift katmanlı fosfolipit nedir ve nasıl oluşur?",
        "Yarı geçirgen zar ne anlama gelir ve nasıl çalışır?",
        "Hücre zarında hidrofobik ve hidrofilik bölgeler nasıl konumlanmıştır?",
        "Hücre zarının yapısında fosfolipitler dışında hangi makromoleküller bulunur?"
    ],
    "Pasif  Taşıma Tekrar": [
        "Pasif taşıma nedir?",
        "Konsantrasyon gradyanı ne anlama gelir?",
        "Denge durumunda maddelerin hareketi durur mu?",
        "Hücre zarının geçirgenliği nedir?",
        "Difüzyon sürecinde maddeler nasıl hareket eder?",
        "Hangi maddeler hücre zarından serbestçe geçebilir?",
        "Kolaylaştırılmış difüzyon hangi maddeler için gereklidir?",
        "Zar proteinleri ne işe yarar?",
        "Kolaylaştırılmış difüzyon nedir?"
    ],
    "Aktif Taşıma Tekrar": [
        "Aktif taşımanın gerçekleşmesi için hangi enerji taşıyıcısı kullanılır?",
        "Konsantrasyon gradyanı nedir?",
        "ATP'nin açılımı nedir?",
        "Aktif taşıma sırasında maddeler hangi yönde hareket eder?",
        "Aktif taşımanın pasif taşımadan farkı nedir?",
        "Aktif taşımada hangi tür proteinler kullanılır?",
        "Taşıyıcı proteinler neden ATP'ye ihtiyaç duyar?",
        "Kolaylaştırılmış difüzyon ve aktif taşıma arasındaki fark nedir?",
        "Kanal proteinleri aktif taşımada kullanılır mı?"
    ],
    "Hücresel Solunum ve Redoks": [
        "Glikozun hücresel solunumda parçalanması sonucu hangi moleküller ortaya çıkar?",
        "Katabolik tepkimeler nedir?",
        "Alt tabaka fosforilasyonu nedir ve ne zaman gerçekleşir?",
        "Oksidatif fosforilasyonun temel prensibi nedir?",
        "NAD+ ve FAD gibi elektron taşıyıcılarının hücresel solunumdaki rolü nedir?",
        "Elektron taşıma zinciri nedir ve nasıl çalışır?",
        "Redoks tepkimeleri hücresel solunumda neden önemlidir?",
        "Glikozun parçalanma tepkimesi sonucunda ne kadar enerji açığa çıkar?",
        "Mitokondrinin iç zarının yapısı ve işlevi nasıldır?"
    ],
    "Glikoliz": [
        "Glikoliz nedir?",
        "Glikoliz hangi molekülün parçalanmasıyla başlar?",
        "Glikoliz hangi hücresel yapıda gerçekleşir?",
        "Enerji gerektiren evrede kaç ATP molekülü kullanılır?",
        "Gliseraldehit 3-fosfat hangi evrede oluşur?",
        "Glikoliz sonucu kaç adet pirüvat molekülü üretilir?",
        "Glikolizin ikinci yarısında kaç adet ATP molekülü üretilir?",
        "Fosfofruktokinaz enziminin görevi nedir?",
        "NADH hangi süreçte NAD+ formuna geri döner?"
    ],
    "Fotosentez": [
        "Fotosentez nedir?",
        "Fotosentez sırasında hangi maddeler glikoz ve oksijen üretmek için kullanılır?",
        "Glikoz molekülleri hücreler için hangi işlemlerle enerji kaynağı olarak kullanılır?",
        "Karbon fiksasyonu nedir?",
        "Ototrofların en önemli özelliği nedir?",
        "Fotosentez yapan organizmalar neden ekosistemler için önemlidir?",
        "Işığa bağlı tepkimeler nerede gerçekleşir?",
        "Calvin döngüsü nerede gerçekleşir ve hangi maddelerden faydalanır?",
        "Fotosentez ve hücresel solunum arasındaki temel fark nedir?"
    ],
    "Işık ve Fotosentetik Pigmentler": [
        "Güneş enerjisinin insan vücudunda hangi vitaminin üretiminde kullanıldığını belirtiniz.",
        "Fotosentez süreci hangi organik moleküller tarafından başlatılır?",
        "Elektromanyetik spektrumda insan gözüyle görülebilen kısmın dalga boyu aralığı nedir?",
        "Uzun dalga boyuna sahip olan radyasyon türleri neden daha az enerjiye sahiptir?",
        "Klorofil gibi pigmentler bitkilere hangi rengi verir?",
        "Güneş ışığındaki hangi dalga boyları fotosentez süresince eşit olarak kullanılmaz?",
        "Fotosentez yapan tüm bitkilerde bulunan klorofil türü hangisidir?",
        "Karotenoidler bitkiler tarafından hangi amaçla kullanılır?",
        "Klorofil moleküllerinin yapısında hangi elementin çevrelendiği çember şeklinde bir atom grubu bulunur?"
    ],
    "Fotosolunum": [
        "Rubisco enzimi hangi karbon sabitlenmesi sürecinde yer alır?",
        "Rubisco'nun substrat olarak kullanabileceği iki molekül nedir?",
        "Fotosolunum süreci hangi substratın kullanılmasıyla başlar?",
        "Fotosolunumun sonucu olarak hangi molekül kaybedilir?",
        "Fotosolunumun en çok arttığı çevresel koşullar nelerdir?",
        "Rubisco'nun CO2 ve O2'ye olan ilgisi hangi faktörle değişir?",
        "Bitki stromatalarının kapanması fotosolunumu nasıl etkiler?",
        "Fotosolunum sırasında iki glisin molekülü mitokondride hangi amino aside dönüştürülür?",
        "Fosfoglikolat kloroplasttan peroksizoma taşındığında ilk olarak hangi bileşiğe dönüşür?"
    ],
    "C3, C4 ve CAM bitkileri": [
        "Fotosolunum nedir?",
        "C3 bitkilerinin fotosolunum ile ilgili problemleri nelerdir?",
        "C4 bitkileri fotosolunumu nasıl minimize eder?",
        "CAM bitkileri fotosolunumu nasıl minimize eder?",
        "Calvin döngüsünde rubisco enziminin rolü nedir?",
        "C3 bitkilerinin dünya üzerindeki yaygınlığı nedir?",
        "C4 bitkilerinde okzaloasetat nasıl oluşur?",
        "CAM bitkileri su kaybını nasıl engeller?",
        "Fotosolunumun yüksek sıcaklıklarda artmasının nedeni nedir?"
    ],
    "Hücreler Arası İletişim": [
        "Hücreler neden kimyasal sinyal molekülleri kullanarak iletişim kurarlar?",
        "Bir hücrenin bir sinyali fark edebilmesi için hangi özelliklere sahip olması gerekir?",
        "Ligand terimi ne anlama gelir?",
        "Hücreler arası sinyal iletimi nasıl gerçekleşir?",
        "Parakrin sinyal iletimi nedir ve ne tür hücrelerde görülür?",
        "Sonic hedgehog (Shh) sinyal molekülü hangi gelişimsel süreçte önemli bir rol oynar?",
        "Sinaptik sinyal iletimi nasıl çalışır ve hangi hücreler arasında gerçekleşir?",
        "Otokrin sinyal iletimi nasıl işler ve hangi süreçlerde önemli rol oynar?",
        "Endokrin sinyal iletimi nedir ve hangi bezler bu tür sinyaller üretir?"
    ],
    "Ligand ve Reseptörler": [
        "1. Bir hücre içinde sinyal yolağının başlama süreci nasıl gerçekleşir?",
        "2. Reseptörlerin ve ligandların ortak özellikleri nelerdir?",
        "3. Hücre içi reseptörlerin ligandları genellikle hangi tür moleküllerdir?",
        "4. Estradiol ve testosteron hangi tür reseptörlere bağlanır?",
        "5. Transkripsyon nedir ve hangi aşamalardan oluşur?",
        "6. Hücre yüzeyi reseptörlerinin tipik yapısı nasıldır?",
        "7. G proteinine bağlı reseptörlerin (GPCR) çalışma mekanizması nasıl işler?",
        "8. G proteinine bağlı reseptör sinyal yolağına müdahale eden bakteriler hangi hastalıklara yol açar?",
        "9. Reseptör tirozin kinaz (RTK) sinyal yolağı nasıl çalışır?"
    ],
    "Sinyal Aktarım Yolakları": [
        "1. Bir hücreden salgılanan sinyal verici molekül diğer bir hücrenin reseptörüne bağlandığında sinyal iletim süreci tamamlanmış olur mu?",
        "Hücre içi sinyal iletim yolağı nedir?",
        "Ligand bir hücre yüzeyindeki reseptöre bağlandığında ne olur?",
        "Sinyal iletim yolağında akış yukarı ve akış aşağı ne anlama gelir?",
        "Fosforlanma nedir ve nasıl gerçekleşir?",
        "Fosfat grupları hangi amino asitlere bağlanabilir?",
        "Fosforlanmanın bir proteinin davranışını nasıl değiştirdiği temel biyokimyada nasıl açıklanır?",
        "Fosforlanma işlemi kalıcı mıdır?",
        "İkincil haberci molekülleri nelerdir?"
    ],
    "Bir Sinyale Verilen Cevap": [
        "Hücre sinyal yolaklarının ortak noktası nedir?",
        "Gen ifadesinin iki temel adımı nelerdir?",
        "Büyüme faktörü sinyali hücresel cevaplarda nasıl bir rol oynar?",
        "Transkripsiyon sürecinde DNA'nın hangi moleküle kopyalanması gerçekleşir?",
        "Translasyon sürecinde RNA'dan hangi tür molekül sentezlenir?",
        "Epinefrinin kas hücrelerindeki etkisi nasıl gerçekleşir?",
        "Apoptoz nedir ve hücrelerde nasıl tetiklenir?",
        "c-Myc proteininin aşırı etkinliği ne tür bir duruma yol açabilir?",
        "Epinefrin sinyali hangi tür reseptörle etkileşime girer?"
    ],
    "Homeostaz": [
        "Homeostaz nedir?",
        "Negatif geri bildirim döngüsü nasıl çalışır?",
        "Pozitif geri bildirim döngüsü nedir?",
        "Homeostazın vücut sıcaklığını nasıl koruduğunu bir örnekle açıklayınız.",
        "Hipotalamusun vücut sıcaklığını düzenlemedeki rolü nedir?",
        "Kan şekeri düzenlemesinde insülinin işlevi nedir?",
        "Glukagon hangi durumlarda salgılanır ve ne yapar?",
        "Diyabet nasıl ortaya çıkar?",
        "Homeostazın bozulması ne gibi sonuçlar doğurabilir?"
    ],
    "Apoptoz": [
        "Apoptoz nedir?",
        "Nekroz ile apoptoz arasındaki temel fark nedir?",
        "Apoptoz sürecinde hücrelerin içeriği nasıl paketlenir?",
        "Apoptozun embriyonik gelişimdeki rolü nedir?",
        "Apoptozun bağışıklık sistemi açısından önemi nedir?",
        "Apoptoz sırasında hücrelerde hangi yapısal değişiklikler meydana gelir?",
        "Nekrozun hücrelerde neden olduğu olaylar nelerdir?",
        "Apoptoz hangi hücreler için faydalıdır?",
        "Apoptozun kanserli hücrelerle olan ilişkisi nedir?"
    ],
    "Mendel ve Bezelyeleri": [
        "* Kendi ailemiz ve arkadaşlarımızla vakit geçirdiğimizde hangi özelliklerin aile içinde aktarıldığını fark edebiliriz?",
        "Genetik temel nedir ve bir kişinin karakteristik özellikleri ile nasıl bağlantılıdır?",
        "İnsan kalıtım özelliklerini incelemek neden zor olabilir?",
        "Gregor Mendel neden bezelye bitkilerini kullanarak kalıtımı inceledi?",
        "Bezelye bitkileri, insanlara göre kalıtım incelemesi için neden daha uygundur?",
        "Mendel'in bezelye bitkileri üzerindeki çalışmaları kalıtımın hangi temel ilkelerini ortaya çıkarmıştır?",
        "Mendel'in deneylerinde baskın ve çekinik özellikler nasıl tanımlanmıştır?",
        "Mendel'in deneylerinde 3:1 oranı neyi ifade eder?",
        "Mendel'in kalıtım araştırmaları hangi prensiplere dayanmaktadır?"
    ],
    "Ayrılma Yasası": [
        "Gregor Mendel bezelyeler üzerinde hangi özelliklerin kalıtımını incelemiştir?",
        "Mendel'in kalıtım modeli hangi önemli oranla başlamıştır?",
        "Baskın ve çekinik alellerin tanımı nedir?",
        "Kendi kendine tozlaşma nedir?",
        "Punnett kareleri ne için kullanılır?",
        "Test çaprazlaması nedir ve neyi belirlemek için kullanılır?",
        "Mendel'in deneyinde F1 dölleri ne renk çiçeklere sahiptir?",
        "F2 dölleri arasında mor ve beyaz çiçeklerin oranı nedir?",
        "Genotip ve fenotip arasındaki fark nedir?"
    ],
    "Mendel Genetiğinde Varyasyon (Özet)": [
        "Mendel'in temel kalıtım modeli nedir?",
        "Mendel'in modeline göre genler nasıl bulunur?",
        "Mendel'in modeline göre alel nedir?",
        "Baskın alel nedir ve nasıl etki eder?",
        "Ayrılma kanunu nedir?",
        "Serbest dağılım yasası nedir?",
        "Eksik baskınlık nedir?",
        "Eş baskınlık nedir?",
        "Pleiotropi nedir?"
    ],
    "Poligenik Kalıtım ve Çevresel Etkiler": [
        "Boy uzunluğu kalıtım yoluyla nasıl aktarılır?",
        "Sürekli varyasyon nedir ve Mendel'in bezelye bitkileriyle nasıl karşılaştırılır?",
        "Boy uzunluğunun kalıtımında kaç genin rol oynadığı tespit edilmiştir?",
        "Poligenik kalıtım nedir ve boy uzunluğuyla nasıl ilişkilidir?",
        "Boy uzunluğu sadece genetik faktörlere mi bağlıdır?",
        "Çevresel faktörlerin boy uzunluğu üzerindeki etkileri nelerdir?",
        "Buğday tanelerinde kırmızımsı pigment yapan genler nasıl çalışır?",
        "Fenilketonüri (PKU) nedir ve nasıl tedavi edilir?",
        "Değişken ifade ve eksik penetrans kavramları nedir?"
    ],
    "Mitokondri ve Kloroplast DNA'larının Kalıtımı": [
        "Mitokondri ve kloroplastlarda bulunan DNA'nın yapısı nasıldır?",
        "Endosimbiyont teori nedir ve mitokondri ile kloroplastlarda nasıl bir kanıt oluşturur?",
        "Mitokondri ve kloroplastlar, hücre bölünmesi sırasında nasıl dağılırlar?",
        "İnsanlarda mitokondriyel DNA hangi ebeveynden aktarılır?",
        "Carl Correns'in akşamsefası bitkileriyle yaptığı deneylerde hangi bulgular elde edilmiştir?",
        "Mitokondri ve kloroplast DNA'larının kopya sayıları neden fazladır?",
        "Mitokondrilerdeki DNA kopyalarının aynı olmaması ne anlama gelir?",
        "Kearns-Sayre sendromu hangi tür DNA mutasyonundan kaynaklanır?",
        "Mitokondriyel DNA, soy ağacının oluşturulmasında nasıl kullanılır?"
    ],
    "Klasik Deneyler: Genetik Materyal Olarak DNA": [
        "DNA'nın kalıtımdaki rolü nedir?",
        "Frederick Griffith'in 1928'de yaptığı deneylerde hangi bakteriyi kullanmıştır?",
        "R suşunun özellikleri nelerdir?",
        "S suşunun özellikleri nelerdir?",
        "Avery, McCarty ve MacLeod'un 1944 yılında gerçekleştirdiği çalışmanın amacı neydi?",
        "Avery, McCarty ve MacLeod, dönüşüm prensibini tanımlamak için hangi yöntemleri kullandılar?",
        "Hershey ve Chase'in deneylerinde hangi organizmalar kullanılmıştır?",
        "Hershey ve Chase'in deneylerinde kullanılan radyoaktif izotoplar nelerdir?",
        "Hershey ve Chase'in deneylerinin sonuçları nelerdir?"
    ],
    "DNA Replikasyonu Yöntemi: Meselson-Stahl Deneyi": [
        "DNA replikasyonu için öne sürülen üç model nelerdir?",
        "Yarı korunumlu replikasyon modeline göre DNA nasıl eşlenir?",
        "Meselson ve Stahl deneyinde hangi organizma kullanılmıştır?",
        "Meselson ve Stahl deneyinde kullanılan azot izotopları nelerdir?",
        "Korunumlu replikasyon modeline göre DNA nasıl eşlenir?",
        "Parçalı (dispersif) replikasyon modeline göre DNA nasıl eşlenir?",
        "Meselson-Stahl deneyinde DNA'nın yoğunluğunu belirlemek için hangi teknik kullanılmıştır?",
        "Meselson ve Stahl, DNA'nın yarı korunumlu eşlendiğini nasıl doğrulamışlardır?",
        "Parçalı replikasyon modeline göre DNA replikasyonu sırasında neler gerçekleşir?"
    ],
    "Gen İfadesine Giriş (Merkezi Dogma)": [
        "1. DNA, dünya üzerindeki tüm organizmaların hangi materyalidir?",
        "2. DNA ebeveynlerden çocuklara geçtiğinde hangi özellikleri belirleyebilir?",
        "3. Genler hangi tür fonksiyonel ürünleri belirler?",
        "4. Mendel’in çiçek rengi geni neyin talimatlarını içerir?",
        "5. Polipeptit nedir?",
        "6. Polipeptitleri belirleyen genlere ne ad verilir?",
        "7. Hangi tür genler translasyonda rol oynayan fonksiyonel RNA moleküllerini sentezler?",
        "8. Bir genin belirli bir DNA dizilimi, hücrenin ihtiyacı olan hangi ürünlerin sentezlenmesi için talimatlar içerir?",
        "9. Beadle ve Tatum'un 1940'larda yaptıkları deneyler hangi fikre dayanır?"
    ],
    "Genetik Kod": [
        "Genetik kod nedir?",
        "Protein sentezi hangi iki adımda gerçekleşir?",
        "Transkripsiyon nedir?",
        "Translasyon nedir?",
        "Bir kodon nedir ve nasıl okunur?",
        "Başla kodonu ve stop kodonları nedir?",
        "mRNA'nın 5'-3' yönü ne anlama gelir?",
        "N-terminus ve C-terminus nedir?",
        "Genetik kodun üniversal olmasının anlamı nedir?"
    ],
    "Bir Gen, Bir Enzim": [
        "Sör Archibald Garrod'un genlerin enzimlerle bağlantılı olduğunu ortaya atan ilk bilim insanı olduğunu kim doğrulamıştır?",
        "Beadle ve Tatum hangi organizma üzerinde çalışarak Garrod'un hipotezlerini doğrulamıştır?",
        "Nörospor hücreleri laboratuvarda nasıl bir ortamda yetiştirilebilmektedir?",
        "Garrod'un çalışmaları hangi hastalığa odaklanmıştır?",
        "Alkaptonüri hastalığında bireylerin idrarı neden siyah renk alır?",
        "Beadle ve Tatum'un deneylerinde minimal besiyeri neden kullanılmıştır?",
        "Ekmek küfü, genetik deneyler için neden uygun bir organizma olarak seçilmiştir?",
        "Beadle ve Tatum'un ekmek küflerini radyasyona maruz bırakmalarındaki amaç neydi?",
        "Alternatif splicing nedir ve hangi organizmalarda görülür?"
    ],
    "Transkripsiyon (Özet)": [
        "Transkripsiyon nedir?",
        "Transkripsiyon hangi enzim tarafından gerçekleştirilir?",
        "RNA polimerazın işlevi nedir?",
        "Transkripsiyonun üç aşaması nelerdir?",
        "Ökaryotlarda RNA moleküllerinin transkripsiyondan sonra hangi işlemlerden geçmesi gerekir?",
        "Transkripsiyonun amacı nedir?",
        "Bir genin transkripsiyonu sırasında hangi genetik bilgi kopyalanır?",
        "Transkripsiyon sırasında RNA polimeraz hangi DNA dizilimine bağlanır?",
        "RNA transkripti, DNA'sının hangi ipliği ile aynı bilgiyi taşır?"
    ],
    "Transkripsiyon Evreleri": [
        "Transkripsiyon nedir?",
        "Transkripsiyon sürecinde en önemli enzim nedir?",
        "Transkripsiyonun başlaması için RNA polimeraz nereye bağlanır?",
        "Transkripsiyon sırasında RNA polimeraz, DNA'nın hangi ipliğini şablon olarak kullanır?",
        "Transkripsiyon süreci nasıl sonlanır?",
        "Köygöçüren mantarının ölümcül olmasının sebebi nedir?",
        "Transkripsiyon sırasında DNA'nın açılan bölgesi ne olarak adlandırılır?",
        "Yeni sentezlenen RNA'da hangi nükleotid, timin (T) yerine geçer?",
        "RNA polimeraz hangi yönde yeni RNA ipliğini sentezler?"
    ],
    "Ökaryotik pre-mRNA'nın İşlenmesi": [
        "1. Pre-mRNA nedir ve nasıl bir mRNA'ya dönüşür?",
        "RNA transkriptinin başına ve sonuna eklenen kimyasal gruplar nelerdir?",
        "Uçbirleştirme (splicing) işlemi sırasında ne olur?",
        "Alternatif uçbirleştirme nedir ve neden önemlidir?",
        "Ökaryotik hücrelerde RNA transkriptinin işlenme aşamaları nelerdir?",
        "5' başlık ve poli-A kuyruğu ne işe yarar?",
        "Splisozomun RNA uçbirleştirmedeki rolü nedir?",
        "İntronların çıkarılmaması durumunda ne olur?",
        "Alternatif uçbirleştirmenin evrimsel avantajları nelerdir?"
    ],
    "Translasyon (Özet)": [
        "Proteinler hücrelerde nasıl üretilir?",
        "Transkripsiyon aşamasında ne olur?",
        "Translasyon aşamasında mRNA'nın \"şifresi\" nasıl çözülür?",
        "Amino asit nedir ve proteindeki rolü nedir?",
        "Ribozomların translasyondaki rolü nedir?",
        "Transfer RNA (tRNA) nedir ve translasyonda nasıl görev alır?",
        "Genetik kod nedir ve nasıl çalışır?",
        "mRNA'daki kodonlar nasıl okunur ve neyi belirler?",
        "Başlangıç kodonu nedir ve hangi amino asidi kodlar?"
    ],
    "Özet: Bakterilerde Gen Regülasyonu": [
        "Bakteriyel genlerin çoğu genellikle nerede bulunur?",
        "Bir operondaki genlerin transkripsiyonu nasıl gerçekleşir?",
        "Regülatör DNA dizilerinin işlevi nedir?",
        "Regülatör proteinler nasıl aktive veya inaktive edilir?",
        "Hangi operonlar belirli küçük moleküller tarafından harekete geçebilir?",
        "Bir operonun promotörü ne işe yarar?",
        "Lac operonu hangi işlevi yerine getirir?",
        "Operonların hepsi bakterilerde mi bulunur?",
        "Operonlar hangi DNA dizilerini içerirler?"
    ],
    "Lac (lak) Operonu": [
        "E. coli'nin lac operonu hangi genleri içerir?",
        "Lac operonu hangi koşullarda ifade edilir?",
        "Lac represör proteini nasıl bir sensör olarak davranır?",
        "Lac represörün operatöre bağlanmasını engelleyen molekül nedir?",
        "Katabolit aktivatör protein (CAP) nasıl bir sensör olarak davranır?",
        "CAP proteini hangi molekül aracılığıyla glikoz seviyelerini algılar?",
        "Lac operonunun yapısına dahil olan üç genin adları nelerdir?",
        "LacZ geni hangi enzimi kodlar ve bu enzim ne işe yarar?",
        "LacY geni tarafından kodlanan zar proteininin adı nedir ve görevi nedir?"
    ],
    "Trp Operonu": [
        "trp operonu nedir?",
        "trp operonunun triptofan seviyesi düşükken nasıl bir tepki verdiğini açıklayın.",
        "trp operonunu hangi protein regüle eder?",
        "trp repressörü nasıl aktive edilir?",
        "atenüasyon nedir ve nasıl çalışır?",
        "trp operonunun yapısında hangi bileşenler bulunur?",
        "trp repressörü hangi gen tarafından kodlanır?",
        "yüksek triptofan konsantrasyonu trp operonunu nasıl etkiler?",
        "ribozomun lider bölgenin translasyonunu tamamlaması triptofan konsantrasyonuna bağlı olarak nasıl değişir?"
    ],
    "Özet: Ökaryotlarda Gen Regülasyonu": [
        "Gen regülasyonu nedir ve ne işe yarar?",
        "Aynı DNA'ya sahip farklı hücrelerin farklı görevler üstlenebilmesinin sebebi nedir?",
        "Karaciğer hücreleri ve nöronlar arasındaki gen ifadesi farkları nelerdir?",
        "Gen ifadesini etkileyen hücre içi faktörlere örnekler veriniz.",
        "Gen ifadesini etkileyen hücre dışı faktörlere örnekler veriniz.",
        "Büyüme faktörlerinin hücredeki etkileri nasıl başlar ve ilerler?",
        "Kromatin erişilebilirliği gen ifadesini nasıl etkiler?",
        "RNA işlenmesi sürecinde hangi işlemler gerçekleşir ve bu işlemler nasıl regüle edilir?",
        "miRNA'lar RNA istikrarını nasıl etkiler?"
    ],
    "Transkripsiyon Faktörleri": [
        "Transkripsiyon faktörleri nedir ve nasıl çalışır?",
        "Aktivatör transkripsiyon faktörlerinin işlevi nedir?",
        "Represör transkripsiyon faktörleri nasıl çalışır?",
        "Transkripsiyon faktörlerinin bağlanma bölgeleri nerede bulunabilir?",
        "Transkripsiyon, bir genin DNA diziliminin hangi moleküle kopyalanması işlemidir?",
        "Bir genin transkripsiyonu gerçekleşmezse, bu gen hücre içinde ne için kullanılamaz?",
        "RNA polimeraz, bir genin DNA'sına nasıl bağlanır?",
        "Transkripsiyon faktörleri nasıl bir mantık işlemi yapabilir?",
        "Farklı hücre tiplerinin hangi transkripsiyon faktörünü yapmaları gerektiğini nereden bildikleri sorusuna hangi biyoloji alanı cevap arar?"
    ],
    "Transkripsiyon Sonrası Regülasyon": [
        "Bir genin transkripsiyonundan sonra gen ifadesi hangi aşamalarda regüle edilebilir?",
        "Alternatif uç birleştirme işlemi ile hangi farklı ürünler elde edilebilir?",
        "mikroRNA'lar mRNA üzerinde nasıl bir etki yapar?",
        "Proteinlerin translasyon sonrası aktiviteleri nasıl regüle edilebilir?",
        "Ökaryot hücrelerde gen ifadesi hangi seviyelerde regüle edilir?",
        "pre-mRNA'nın olgun bir mRNA'ya dönüşmesi için hangi modifikasyonlar gereklidir?",
        "Alternatif uçbirleştirme sürecinin kontrolü hangi proteinler tarafından sağlanır?",
        "mRNA'nın sitozoldaki yaşam döngüsü nasıl regüle edilir?",
        "miRNA'lar mRNA'ya nasıl bağlanır ve hangi etkileri gösterir?"
    ],
    "Biyoteknoloji": [
        "Biyoteknoloji nedir?",
        "Biyoteknolojinin birçok formu hangi teknolojiyi kullanmaktadır?",
        "DNA teknolojisi neleri içerir?",
        "DNA teknolojisinin yaygın formları nelerdir?",
        "Klonlanan ilk memeli hangisidir?",
        "Bir organizmanın belirli bir kullanım alanı olan bir ürün veya süreç oluşturmak için kullanılması ne olarak adlandırılır?",
        "Bira yapımında kullanılan organizma nedir?",
        "Penisilin hangi organizma tarafından üretilir?",
        "Gen terapisi nedir?"
    ],
    "Polimeraz Zincir Reaksiyonu (Tepkimesi) - PCR": [
        "PCR nedir?",
        "PCR'ın adımları nelerdir?",
        "PCR'da kullanılan DNA polimerazın adı nedir?",
        "Taq polimerazın özellikleri nelerdir?",
        "PCR primerleri nedir ve ne işe yarar?",
        "PCR'da şablon DNA'nın denatüre edilmesi ne anlama gelir?",
        "PCR'da primerlerin bağlandığı adım hangi sıcaklıkta gerçekleşir?",
        "PCR tepkimesinde uzatma adımı hangi sıcaklıkta gerçekleşir?",
        "PCR'ın tıbbi teşhislerde nasıl kullanıldığını açıklayın."
    ],
    "Jel Elektroforezi": [
        "Jel elektroforezi nedir ve ne için kullanılır?",
        "DNA numuneleri jel elektroforezinde nasıl yerleştirilir?",
        "DNA fragmanları jel içinde hangi yöne doğru hareket eder ve neden?",
        "Küçük DNA fragmanları jel içinde nasıl hareket eder?",
        "Jel elektroforezi ile DNA fragmanlarının boyutlarını nasıl belirleyebiliriz?",
        "\"Elektroforezi\" kelimesinin kökeni nedir ve ne anlama gelir?",
        "Jel elektroforezinde hangi tip moleküller ayrılabilir?",
        "DNA moleküllerinin jel içinde hareket hızını etkileyen faktörler nelerdir?",
        "Agaroz jelleri nasıl hazırlanır ve jel elektroforezinde ne amaçla kullanılır?"
    ],
    "DNA dizileme": [
        "DNA dizilimi nedir?",
        "Sanger dizilim yöntemi nasıl çalışır?",
        "Yeni nesil dizilim yöntemlerinin avantajları nelerdir?",
        "İnsan Genomu Projesi'nde hangi dizilim yöntemi kullanılmıştır?",
        "Sanger diziliminde kullanılan \"zincir terminatör\" nükleotidlerin işlevi nedir?",
        "Sanger diziliminde gerekli malzemeler nelerdir?",
        "Dideoksi nükleotidler nasıl işaretlenir?",
        "Kapiler jel elektroforezi ne amaçla kullanılır?",
        "Yeni nesil dizilim yöntemlerinde paralellik kavramı nedir?"
    ],
    "DNA’nın Yapısı ve Replikasyonu Tekrar": [
        "DNA nedir?",
        "Nükleotid nedir?",
        "Çift sarmal nedir?",
        "DNA replikasyonu nedir?",
        "Baz eşleşmesi nedir?",
        "DNA hangi dört tip azotlu bazı kullanır?",
        "Chargaff kuralları nelerdir?",
        "DNA'nın çift sarmal yapısı ne zaman ve kimler tarafından keşfedilmiştir?",
        "DNA molekülleri hangi yapıya sahiptir?"
    ],
    "Ökaryotik Gen Transkripsiyonu: DNA'dan mRNA'ya Geçiş": [
        "Genler nerede saklanır?",
        "Ribozomlar hücrenin hangi kısmında bulunur?",
        "mRNA transkripsiyonu nedir?",
        "mRNA'nın yapısı ve DNA'nın yapısı arasındaki farklar nelerdir?",
        "mRNA transkriptlerinin korunması nasıl sağlanır?",
        "İntronların çıkarılması işlemi nasıl gerçekleştirilir?",
        "RNA polimeraz II'nin DNA polimerazdan farkı nedir?",
        "mRNA transkriptinin ribozoma ulaşmadan önce geçirdiği süreçler nelerdir?",
        "RNA interferansı nedir ve ne amaçla kullanılır?"
    ],
    "Soy Ağaçları Tekrar": [
        "Soy ağacı nedir?",
        "Genotip ne anlama gelir?",
        "Fenotip nedir?",
        "Baskın alel nasıl ifade edilir?",
        "Çekinik alel ne zaman ifade edilir?",
        "Otozomal özellikler nelerde bulunur?",
        "Cinsiyete bağlı özellikler hangi kromozomlarda yer alır?",
        "Homozigot birey ne demektir?",
        "Heterozigot birey ne demektir?"
    ],
    "Prokaryotlarda Genetik Varyasyon": [
        "Transformasyon sırasında bakteriler ortamlarından ne alırlar?",
        "Transdüksiyon sırasında DNA bir bakteriden nasıl alınır?",
        "Konjügasyon sırasında DNA bakteriler arasında nasıl aktarılır?",
        "Genetik malzemenin genomda yer değiştirebilen segmentleri nedir?",
        "Bakteriler ikili fisyon ile çoğalırken neden genetik çeşitlilik oluşmaz?",
        "Genetik varyasyon bakteriler için neden önemlidir?",
        "Zararsız bir bakterinin patojen bir bakteriden toksin alması nasıl gerçekleşir?",
        "Bakteriyofajlar bakterilere nasıl enfekte ederler?",
        "F faktörü konjügasyon sırasında nasıl bir rol oynar?"
    ],
    "Virüslerin Evrimi": [
        "Virüslerin hızlı evrimleşebilmesinin temel nedenleri nelerdir?",
        "İki virüs aynı hücreyi enfekte ettiğinde ne gibi bir genetik değişim gerçekleşebilir?",
        "RNA virüslerinin mutasyon oranları neden yüksektir?",
        "Virüslerin genetik malzemelerindeki değişimlere ne ad verilir?",
        "Grip virüsünün her yıl değişmesine neden olan mekanizma nedir?",
        "Doğal seçilim virüs popülasyonlarını nasıl etkiler?",
        "HIV'nin ilaca karşı direnç kazanması nasıl bir evrimsel süreçtir?",
        "Rekombinasyon nedir ve virüslerde nasıl meydana gelir?",
        "HAART tedavisinin amacı nedir ve nasıl çalışır?"
    ],
    "Enzimler Tekrar": [
        "Enzimler ne tür biyolojik moleküllerdir?",
        "Enzimlerin substratın bağlandığı bölgeye ne ad verilir?",
        "Enzimler kimyasal tepkimeleri nasıl hızlandırır?",
        "Enzim aktiviteleri hangi faktörlerden etkilenir?",
        "Optimum sıcaklık ve pH nedir ve enzimler üzerinde nasıl bir etkisi vardır?",
        "Enzimler denatüre olursa ne olur?",
        "Enzim konsantrasyonu tepkime hızını nasıl etkiler?",
        "Substrat konsantrasyonunun tepkime hızına etkisi nedir?",
        "Enzimler neden spesifiktir?"
    ],
    "Fotosentez Tekrar": [
        "Fotosentez nedir?",
        "Fotoototrof nedir?",
        "ATP'nin açılımı nedir ve fotosentezdeki rolü nedir?",
        "Kloroplast nedir ve fotosentezdeki işlevi nedir?",
        "Tilakoidler nedir ve fotosentezdeki rolü nedir?",
        "Grana nedir ve hangi yapıları içerir?",
        "Klorofilin işlevi nedir ve hangi ışık renklerini soğurur?",
        "Stroma nedir ve fotosentezdeki rolü nedir?",
        "Fotosentezin genel denkleminde hangi maddeler kullanılır ve hangi ürünler oluşur?"
    ],
    "Kurbağa Gelişimi Örnekleri": [
        "1. Afrika pençeli kurbağası Xenopus laevis neden gelişimsel biyologlar tarafından popüler bir model organizma olarak kullanılır?",
        "2. Xenopus kurbağasının yumurta hücresindeki mRNA ve proteinlerin dağılımı nasıldır?",
        "3. Sperm yumurtaya girdiğinde hangi vücut eksenleri şekillenmeye başlar?",
        "4. Gri hilal nedir ve ne işe yarar?",
        "5. Spemann'ın Organizatörü nedir ve nasıl çalışır?",
        "6. Xenopus laevis embriyolarının anne kurbağanın vücudu dışında gelişmesinin avantajı nedir?",
        "7. Xenopus embriyosunun döllenmesi nasıl gerçekleşir ve gelişim süreci nasıldır?",
        "8. Yumurta hücresinin hayvan ve vejetal kutupları ne anlama gelir?",
        "9. Kortikal sitoplazmanın dönüşüyle embriyoda hangi eksen oluşur?"
    ],
    "Homeotik Genler": [
        "Homeotik genler nedir?",
        "Homeotik genlerdeki mutasyonlar vücut yapılarında nasıl değişikliklere neden olabilir?",
        "Homeodomain nedir ve hangi tür proteinlerle ilişkilidir?",
        "Hox genleri nasıl ve ne zaman aktive edilir?",
        "Hox genleri hangi hayvanlarda bulunur?",
        "İnsanlarda Hox genlerindeki mutasyonlar ne tür genetik bozukluklara neden olabilir?",
        "Antennapedia geni normalde hangi segmentte ifade edilir ve bu genin rolü nedir?",
        "Ultrabithorax geninin fonksiyonu nedir ve mutasyon sonucu ne tür değişikliklere yol açabilir?",
        "Hox genlerinin kromozom üzerindeki dizilimi neyi yansıtır?"
    ],
    "Prokaryot Üremesi ve Biyoteknoloji": [
        "Prokaryotlar nasıl ürer?",
        "E. coli bakterileri laboratuvarlarda neden yaygın olarak kullanılır?",
        "Plazmid nedir ve E. coli bakterilerine nasıl aktarılır?",
        "İkiye bölünme sürecinin adımları nelerdir?",
        "E. coli bakterilerinin nesil süresi ne kadardır?",
        "Bakterilerin hızlı üreme yeteneği nasıl ölçülür?",
        "Laboratuvarda kullanılan E. coli suşları zararlı mıdır?",
        "E. coli bakterileri nasıl DNA veya protein fabrikaları olarak kullanılır?",
        "Dönüşüm deneyinde plazmidin içerdiği antibiyotik direnci geninin rolü nedir?"
    ],
    "Prokaryot Metabolizması": [
        "Prokaryotların enerji kaynağı olarak ne kullanabilen türlerine ne ad verilir?",
        "Prokaryotlar karbonu hangi iki kaynaktan alabilirler?",
        "Zorunlu oksijensizler nasıl metabolize olurlar?",
        "Prokaryotların hangi türleri oksijensiz ortamda da metabolizma yapabilirler?",
        "Thiobacillus concretivorans isimli bakteri nasıl enerji sağlar?",
        "Fotosentetik prokaryotlar karbonu nasıl sabitlerler?",
        "Azot sabitleyici prokaryotlar atmosferik azotu hangi bileşiğe dönüştürürler?",
        "Prokaryotların besin zincirinde oynadığı roller nelerdir?",
        "Azot döngüsünde prokaryotlar hangi kimyasal dönüşümleri gerçekleştirirler?"
    ],
    "Prokaryot Etkileşimleri ve Ekoloji": [
        "Bakteriler neden kooperasyona yatkın organizmalardır?",
        "Biyofilmler nedir ve nasıl oluşurlar?",
        "Bakterilerin bitkiler, hayvanlar veya mantarlarla kurdukları bağlar hangi kategorilerde sınıflandırılabilir?",
        "Mikobakteriler neden kaynak sıkıntısı olduğunda sporokarplar oluştururlar?",
        "Anabaena cinsinden siyanobakteriler nasıl birlikte çalışır ve azot sabitlemesi sorununu nasıl çözer?",
        "Biyofilmlerin yapısal özellikleri ve işlevleri nelerdir?",
        "Bakteriler arasındaki mutualizm, kommensalizm ve parazitizm nedir?",
        "Ruminococcus bakterilerinin ineklerle kurduğu mutualist ilişki nasıl işler?",
        "Bakteriler arasındaki kooperasyon neden bazı biyologlar tarafından çok hücreli organizmalar gibi değerlendirilir?"
    ],
    "Prokaryot Sınıflandırması ve Çeşitliliği": [
        "1. Bakteriler ve arkeler ne zaman birbirinden ayrıldı?",
        "2. Bakterilerin çeşitliliği hangi özellikler üzerine kurulu?",
        "3. Arkelerin yaşadığı ortamlarda hangi özellikler dikkat çeker?",
        "4. Metagenomi nedir ve ne amaçla kullanılır?",
        "5. Prokaryotların tespiti ve sınıflandırılması neden zordur?",
        "6. Carl Woese prokaryotların iki farklı soya ayrıldığını nasıl keşfetti?",
        "7. Ribozomal RNA (rRNA) genleri ne için kullanılır?",
        "8. Proteobakterilerin beş farklı gruba ayrılmasının nedeni nedir?",
        "9. Gram pozitif bakterilerin bazı örnekleri nelerdir ve bunların etkileri nelerdir?"
    ],
    "Virüslere Giriş": [
        "Virüsler nasıl ürer?",
        "Virüslerin yapısında hangi genetik materyal bulunur?",
        "Virüslerin kapsitlerinin görevi nedir?",
        "Virüslerin çoğunlukla nerede bulunduğu bilinmektedir?",
        "Virüslerin canlı olmadıkları düşünülmesinin sebebi nedir?",
        "Bakteriler ve virüsler arasındaki temel fark nedir?",
        "En büyük virüs hangisidir?",
        "Virüslerin yaşam döngüsündeki ilk evre nedir?",
        "Kapsit ve kapsomer arasındaki fark nedir?"
    ],
    "Bakteriyofajlar": [
        "Bakteriyofaj nedir?",
        "Bakteriyofajların enfeksiyon döngüleri nelerdir?",
        "Litik döngüde bakteriyofajın konak hücreye nasıl zarar verdiğini açıklayabilir misiniz?",
        "Lizojenik döngüde bakteriyofajın DNA'sı bakteriyel kromozoma nasıl entegre edilir?",
        "Bir bakteriyofaj genomunun yapısı nasıldır?",
        "Bakteriyofajların kapsid yapıları nelerdir?",
        "Lambda (λ) fajının hem litik hem de lizojenik döngüler arasında gidip gelebildiğini biliyor muydunuz?",
        "Bir bakteriyofajın yaşam döngüsünü oluşturan adımlar nelerdir?",
        "Lizojenik döngüde faj DNA'sı neden hemen kopyalanmaz veya protein üretmek için ifade edilmez?"
    ],
    "Hayvan ve İnsan Virüsleri": [
        "1. İnsanlara ve hayvanlara bulaşan virüslerin etkileri nelerdir?",
        "2. Virüsler hangi sınıflandırma sistemi ile kategorize edilir?",
        "3. AIDS'e neden olan HIV hangi virüs sınıfına aittir?",
        "4. Hayvan virüslerinin yapısı nasıldır?",
        "5. Ebola virüsünün şekli nasıldır?",
        "6. Hayvan virüsleri konak hücrelerine nasıl girerler?",
        "7. Klasik akut hastalık paternini izleyen viral enfeksiyonlara örnek veriniz.",
        "8. Baltimore sistemi virüsleri hangi kriterlere göre sınıflandırır?",
        "9. Ters transkriptaz enzimi hangi virüslerin genomunun DNA'ya dönüşümünde görev alır?"
    ],
    "Zika Virüsünün Biyolojisi": [
        "Zika virüsü nedir?",
        "Zika virüsünün hangi ailesine ait olduğu belirtilmiştir?",
        "Zika virüsü ilk olarak ne zaman ve nerede izole edilmiştir?",
        "Zika virüsünün en yaygın bulaşma yolu nedir?",
        "Zika virüsü insan hücrelerine nasıl giriş yapar?",
        "Zika virüsü insanlarda hangi semptomlara yol açabilir?",
        "Zika virüsü hamile kadınlarda hangi ciddi duruma yol açabilir?",
        "Zika virüsünün Amerika kıtasında ilk vakaları ne zaman raporlanmıştır?",
        "Zika virüsü hangi tür hücreleri hedef alabilir?"
    ],
    "Evrim Teorisi": [
        "1. Büyük ölçekli evrime (makro evrim) dair kanıtlar hangi kaynaklardan elde edilir?",
        "2. Homolog ve analog özellikler arasındaki fark nedir?",
        "3. Moleküler benzerlikler yaşamın ortak atasına dair nasıl kanıt sunar?",
        "4. Biyocoğrafya türlerin evrimsel tarihini nasıl anlamamıza yardımcı olur?",
        "5. Fosiller evrim tarihine nasıl katkı sağlar?",
        "6. Darwin evrimi nasıl tanımlamıştır?",
        "7. Günümüzde birçok biyolog evrimi nasıl tanımlar?",
        "8. Embriyoloji evrimsel kanıt olarak nasıl kullanılır?",
        "9. DNA dizilimleri farklı türler arasındaki bağlantıları nasıl ortaya çıkarır?"
    ],
    "Yok Oluş Düzeyinde Bir Olayda Hayatta Kalmak": [
        "Kitlesel yok oluş olayları nedir?",
        "Jeologlar ve paleontologlar ne tür kanıtları kullanarak kitlesel yok oluş olaylarını incelerler?",
        "K-T olayı ne zaman meydana geldi?",
        "K-T olayının neden olduğu düşünülen kozmik cismin olası yapısı nedir?",
        "K-T olayının etkileri nelerdir?",
        "Walter Alvarez'in K-T olayıyla ilgili keşfi nedir?",
        "Chicxulub krateri nerede bulunmaktadır?",
        "Beş büyük kitlesel yok oluş olayından biri olan Son Permiyen yok oluşu sırasında hangi türlerin çoğu yok oldu?",
        "Kitlesel yok oluş olaylarının olası nedenleri nelerdir?"
    ],
    "Kitlesel Yok Oluşların Kısa Bir Tarihçesi": [
        "Kitlesel yok oluşlar nedir?",
        "En büyük kitlesel yok oluş olayı ne zaman gerçekleşmiştir?",
        "Ordovisyen-Silüriyen kitlesel yok oluş olayında hangi canlılar ölmüştür?",
        "Devon kitlesel yok oluş olayı hangi türleri etkilemiştir?",
        "Permiyen-Trias kitlesel yok oluş olayı kaç milyon yıl önce gerçekleşmiştir?",
        "Triyasik-Jura kitlesel yok oluş olayının sonucu olarak ne ortaya çıkmıştır?",
        "Kretase-Tersiyer kitlesel yok oluş olayı ne zaman gerçekleşmiştir?",
        "K-T kitlesel yok oluş olayı neden bu isimle adlandırılmıştır?",
        "Kretase döneminin sonu ve Tersiyer dönemin başlangıcı hangi kitlesel yok oluş olayı ile ilişkilidir?"
    ],
    "Evrim: Doğal Seçilim ve İnsan Seçilimi Makalesi": [
        "İnek sütünü sindirebilme yeteneği ne zaman ve neden evrimsel bir avantaj haline gelmiştir?",
        "İnsanların yetişkinlik döneminde laktozu sindirebilme yeteneği hangi genetik değişime bağlıdır?",
        "Doğal seçilim nedir ve nasıl işler?",
        "Antibiyotik direnci nasıl bir doğal seçilim örneğidir?",
        "Yapay seçilim ile doğal seçilim arasındaki farklar nelerdir?",
        "Köpeklerin evcilleştirilmesi sürecinde hangi tür seçilim kullanılmıştır?",
        "Safkan köpekler yerine melez ve karma ırkları seçmenin genetik avantajları nelerdir?",
        "Genetiği değiştirilmiş organizmalar (GDO) nasıl oluşturulur ve tarımda ne tür yararlar sağlar?",
        "Evrim, adaptasyon ve doğal seçilim arasındaki farklar nelerdir?"
    ],
    "RNA Dünya": [
        "RNA dünya hipotezi nedir?",
        "RNA'nın kendi kendini kopyalayabilmesi neden önemlidir?",
        "DNA ve RNA'nın temel işlevleri nelerdir?",
        "RNA'nın proteinler gibi kimyasal tepkimeleri düzenleyebildiği nasıl keşfedildi?",
        "İlk RNA'lar nasıl evrildi?",
        "Bilim insanları RNA'nın nükleotitlerden oluştuğunu nasıl öne sürüyorlar?",
        "RNA'lar nasıl çoğalır ve yaşam formlarını oluşturur?",
        "Nükleotit oluşturan RNA'lar ne işe yarar?",
        "Test tüplerinde RNA'nın nükleotit oluşturma işlevi nasıl kanıtlandı?"
    ],
    "Ekoloji Nedir?": [
        "Ekoloji nedir?",
        "Biyotik faktörler nelerdir?",
        "Abiyotik faktörler nelerdir?",
        "Ekolojinin ele aldığı düzeyler nelerdir?",
        "Ormanlarda organizmaların etkileşim örnekleri nelerdir?",
        "Küfün gelişimi için gerekli abiyotik faktör nedir?",
        "Kırmızı panda popülasyonunun azalmasındaki biyotik faktörler nelerdir?",
        "Ekolojistler kırmızı pandalar üzerine hangi disiplinlerde araştırmalar yapar?",
        "Ekosistem ekolojistleri neye odaklanır?"
    ],
    "Ekolojik Seviyeler: Bireylerden Ekosistemlere...": [
        "1. Ekosistemi oluşturan çeşitli bileşenler arasındaki ince ama önemli farklılıkları anlamak için nelerin bilinmesi gerekir?",
        "2. Bir birey nedir ve örnek verilebilecek bazı birey türleri nelerdir?",
        "3. Tür terimi neyi ifade eder ve bilim insanları türleri nasıl adlandırır?",
        "4. Bilimsel adların önemi nedir ve neden sadece tek bir türe aittirler?",
        "5. Popülasyon nedir ve popülasyonlar coğrafi olarak nasıl tanımlanır?",
        "6. Türlerin kaç popülasyondan oluştuğu neye bağlıdır?",
        "7. Komüniteler neyi ifade eder ve neden \"belirli bir alan\" gibi tanımlanmamış bir ifade kullanılır?",
        "8. Komünite kavramı için en önemli unsur nedir?",
        "9. Komüniteler ile ekosistemler arasındaki fark nedir?"
    ],
    "Popülasyonun Düzenlenmesi": [
        "Popülasyon büyüklüğünü ve büyümesini sınırlayan faktörler nelerdir?",
        "Yoğunluğa bağımlı sınırlayıcı faktörlerin popülasyon büyüklüğüne etkisi nasıl olur?",
        "Yoğunluktan bağımsız sınırlayıcı faktörlere örnek verebilir misiniz?",
        "Popülasyon içi rekabetin yoğunluğa bağımlı sınırlayıcı faktörler arasındaki rolü nedir?",
        "Popülasyon büyüklüğünün taşıma kapasitesine ulaşması ne anlama gelir?",
        "Predasyonun popülasyon dinamiklerine etkisi nedir?",
        "Yoğunluğa bağımlı faktörler neden negatif geri bildirim örneği gösterir?",
        "Popülasyon büyüklüğünde döngüsel dalgalanmalar nasıl oluşur?",
        "Yoğunluğa bağımlı olmayan sınırlayıcı faktörlerin popülasyon büyüklüğüne etkisi nasıldır?"
    ],
    "Ekolojik Etkileşimler": [
        "Organizmalar arasındaki etkileşimler neden hayati öneme sahiptir?",
        "Heterotrof ve ototrof arasındaki fark nedir?",
        "Avcı ve av arasındaki ilişkiyi tanımlayınız.",
        "Fotosentez ve kemosentez arasındaki fark nedir?",
        "Birincil tüketici, ikincil tüketici ve üçüncül tüketici terimlerini açıklayınız.",
        "Detritivorlar ve ayrıştırıcılar ekosistemde hangi rolü oynar?",
        "Mutualizm nedir ve bir örnek veriniz.",
        "Parazitizm ve avlanma arasındaki fark nedir?",
        "Kommensalizm nedir ve bir örnek veriniz."
    ],
    "İstilacı Türler": [
        "İstilacı türlerin bulundukları ekosistemlere nasıl zarar verdiği belirtilmiş midir?",
        "Kudzu bitkisinin ABD'ye nasıl ve ne amaçla getirildiği açıklanmış mıdır?",
        "Çim sazanının ABD'ye ne zaman ve nasıl getirildiği hakkında bilgi verilmiş midir?",
        "Kudzu bitkisinin ABD'de hangi bölgelerde dikildiğinden bahsedilmiş midir?",
        "Zebra midyesi gibi istilacı türlerin hangi ekosistemleri tehdit ettiği belirtilmiş midir?",
        "Çim sazanının hangi nehirlerde koloniler oluşturduğuna dair bilgi verilmiş midir?",
        "İstilacı türlerin komünite yapısını nasıl değiştirdiği açıklanmış mıdır?",
        "Gümüş sazanının yerel balık türlerine nasıl zarar verdiği belirtilmiş midir?",
        "Kudzu bitkisinin gün boyunca ne kadar uzayabildiği hakkında bilgi verilmiş midir?"
    ],
    "Ekolojik Süksesyon": [
        "Birincil süksesyon nedir?",
        "İkincil süksesyon nedir?",
        "Süksesyon nasıl tanımlanır?",
        "Birincil süksesyon örneği nedir?",
        "İkincil süksesyon örneği nedir?",
        "Pioner (öncü) türler nedir?",
        "İkincil süksesyon sırasında ilk kolonize eden türler nelerdir?",
        "Süksesyon sırasında toprak oluşumu nasıl gerçekleşir?",
        "Süksesyonun nihai sonucu her zaman aynı mıdır?"
    ],
    "Su Döngüsü": [
        "1. Dünya'daki suyun büyük çoğunluğu nerede bulunur?",
        "2. İnsanların ihtiyacı olan tatlı su, Dünya üzerinde ne kadar bir oranda bulunur?",
        "3. Su döngüsünde suyun hal değişimine uğradığı iki süreç nedir?",
        "4. Yeraltı suyu nerelerde bulunur?",
        "5. Akiferler (sutaşırlar) nedir ve ne amaçla kullanılır?",
        "6. Dünya'daki suyun %97,5'i hangi tür sudur?",
        "7. Tatlı suların %1'inden azı nerelerde bulunur?",
        "8. Güneş enerjisinin su döngüsündeki rolü nedir?",
        "9. Yağmur suyu yeryüzüne ulaştığında hangi yolları izleyebilir?"
    ],
    "Sonradan Kazanılan (Öğrenilmiş) Davranışlar": [
        "Alışkanlık nedir ve nasıl oluşur?",
        "Damgalama ne anlama gelir ve hangi hayvanlarda görülür?",
        "Klasik koşullanma nasıl çalışır ve bir örnek verin.",
        "Edimsel koşullanma nedir ve örneklerle açıklayın.",
        "Köpeklerde öğrenilmiş davranışlara örnek verin.",
        "Öğrenilmiş davranışların doğuştan gelen davranışlardan farkı nedir?",
        "Ördek yavrularının bir insanı damgalaması nasıl mümkündür?",
        "Skinner kutusu deneyinde farelerin öğrendiği davranış nedir?",
        "Şempanzelerde problem çözme yeteneği nasıl gösterilmiştir?"
    ],
    "Kanın Bileşenleri": [
        "Parmağınıza bir şey battığında kanın nasıl göründüğünü nasıl tanımlarsınız?",
        "Mikroskop altında kanın hangi bileşenleri gözlemlenebilir?",
        "İnsan kanının temel bileşenleri nelerdir?",
        "Plazmanın kan içindeki yüzdesi nedir?",
        "Alyuvarların (kırmızı kan hücreleri) temel görevi nedir?",
        "Trombositler hangi işlevi yerine getirir?",
        "Akyuvarların (beyaz kan hücreleri) rolü nedir?",
        "Alyuvarların şekli ve boyutu nasıldır?",
        "Alyuvarların ömrü ne kadardır?"
    ]
}